[
  {
    "id": "artist1",
    "name": "The Beatles",
    "bio": "The Beatles were an English rock band, formed in Liverpool in 1960, that comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr.",
    "image": "https://via.placeholder.com/300x300?text=The+Beatles"
  },
  {
    "id": "artist2",
    "name": "Pink Floyd",
    "bio": "Pink Floyd were an English rock band formed in London in 1965. Gaining an early following as a psychedelic band, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows.",
    "image": "https://via.placeholder.com/300x300?text=Pink+Floyd"
  },
  {
    "id": "artist3",
    "name": "Queen",
    "bio": "Queen are a British rock band formed in London in 1970. Their classic line-up was Freddie Mercury (lead vocals, piano), Brian May (guitar, vocals), Roger Taylor (drums, vocals) and John Deacon (bass).",
    "image": "https://via.placeholder.com/300x300?text=Queen"
  },
  {
    "id": "artist4",
    "name": "Led Zeppelin",
    "bio": "Led Zeppelin were an English rock band formed in London in 1968. The group consisted of vocalist Robert Plant, guitarist Jimmy Page, bassist/keyboardist John Paul Jones, and drummer John Bonham.",
    "image": "https://via.placeholder.com/300x300?text=Led+Zeppelin"
  },
  {
    "id": "artist5",
    "name": "The Rolling Stones",
    "bio": "The Rolling Stones are an English rock band formed in London in 1962. Active for over six decades, they are one of the most popular and enduring bands of the rock era.",
    "image": "https://via.placeholder.com/300x300?text=The+Rolling+Stones"
  },
  {
    "id": "artist6",
    "name": "Arctic Monkeys",
    "bio": "Arctic Monkeys are an English rock band formed in Sheffield in 2002. The band consists of Alex Turner, Matt Helders, Jamie Cook, and Nick O'Malley.",
    "image": "https://via.placeholder.com/300x300?text=Arctic+Monkeys"
  },
  {
    "id": "artist7",
    "name": "Dream Theater",
    "bio": "Dream Theater is an American progressive metal band formed in 1985. The band is known for their technical proficiency and complex compositions.",
    "image": "https://via.placeholder.com/300x300?text=Dream+Theater"
  },
  {
    "id": "artist8",
    "name": "Slipknot",
    "bio": "Slipknot is an American heavy metal band formed in Des Moines, Iowa in 1995. The band is known for their aggressive style of music and distinctive image.",
    "image": "https://via.placeholder.com/300x300?text=Slipknot"
  }
]